/* Power Mac G5 */
"DRIVE BAY"		= "Drive Bay";
"BACKSIDE"		= "Main Logic Board Backside";
"U3 HEATSINK"		= "Memory Controller Heatsink";
"MLB MAX6690 AMB"	= "Main Logic Board Ambient";
"MLB INLET AMB"	        = "Main Logic Board Air Inlet";
"CPU A AD7417 AMB"	= "Processor Card A Ambient";
"CPU B AD7417 AMB"	= "Processor Card B Ambient";

"CPU A AD7417 AD1"	= "CPU A Die Temperature";
"CPU A AD7417 AD2"	= "Processor Card A 12V Supply Current";
"CPU A AD7417 AD3"	= "CPU A Voltage";
"CPU A AD7417 AD4"	= "CPU A Current";
"CPU B AD7417 AD1"	= "CPU B Die Temperature";
"CPU B AD7417 AD2"	= "Processor Card B 12V Supply Current";
"CPU B AD7417 AD3"	= "CPU B Voltage";
"CPU B AD7417 AD4"	= "CPU B Current";

"CPU A INTAKE"		= "CPU A Intake Fan";
"CPU A EXHAUST"		= "CPU A Exhaust Fan";
"CPU B INTAKE"		= "CPU B Intake Fan";
"CPU B EXHAUST"		= "CPU B Exhaust Fan";
"SLOT"			= "PCI Slot Fan";
"CPU A PUMP"		= "CPU A Radiator Pump";
"CPU B PUMP"		= "CPU B Radiator Pump";

"SLOT 12V"		= "Slot 12V";
"SLOT 3.3V"             = "Slot 3.3V";
"SLOT 5V"               = "Slot 5V";
"SLOT COMBINED"         = "Slot combined";

/* Third Generation Power Mac G5 */
"KODIAK DIODE"		= "Memory Controller Diode";
"TUNNEL"		= "Air Tunnel";
"TUNNEL HEATSINK"	= "Air Tunnel Heatsink";
"CPU A0 DIODE TEMP"	= "CPU A Core 1 Diode";
"CPU A1 DIODE TEMP"	= "CPU A Core 2 Diode";
"CPU B0 DIODE TEMP"	= "CPU B Core 1 Diode";
"CPU B1 DIODE TEMP"	= "CPU B Core 2 Diode";
"CPU A0 VCORE"		= "CPU A Core 1 Voltage";
"CPU A1 VCORE"		= "CPU A Core 2 Voltage";
"CPU A0 CORE CURRENT"	= "CPU A Core 1 Current";
"CPU A1 CORE CURRENT"	= "CPU A Core 2 Current";
"CPU B0 VCORE"		= "CPU B Core 1 Voltage";
"CPU B1 VCORE"		= "CPU B Core 2 Voltage";
"CPU B0 CORE CURRENT"	= "CPU B Core 1 Current";
"CPU B1 CORE CURRENT"	= "CPU B Core 2 Current";
"DRIVE BAY A INTAKE"	= "Drive Bay A Air Intake";
"EXPANSION SLOTS INTAKE"= "Expansion Slots Intake";

/* PowerBooks */
"GPU"			    = "Graphics Processor";
"CPU/INTREPID BOTTOMSIDE"   = "Processor/Controller Bottomside";
"CPU BOTTOMSIDE"	    = "Processor Bottomside";
"CPU TOPSIDE"               = "Processor Topside";
"PWR SUPPLY BOTTOMSIDE"     = "Power Supply Bottomside";
"GPU BOTTOMSIDE"	    = "Graphics Processor Bottomside";
"GPU TOPSIDE"		    = "Graphics Processor Topside";
"HDD BOTTOMSIDE"            = "Hard Disk Drive Bottomside";
"CPU CORE"                  = "CPU Core";
"REAR LEFT EXHAUST"         = "Rear Left Exhaust";
"REAR RIGHT EXHAUST"        = "Rear Right Exhaust";
"BATTERY"                   = "Battery";
"PWR/MEMORY BOTTOMSIDE"     = "Power Supply/Memory Bottomside";
"GPU ON DIE"                = "Graphics Processor Die";
"REAR MAIN ENCLOSURE"       = "Rear Main Enclosure";
"TRACK PAD"		    = "Trackpad";
"BATT-TEMP"		    = "Battery Temperature";
"BATT-CURRENT"              = "Battery Discharge Current";
"ALS MLB"		    = "Mainboard Light Sensor";
"ALS Sutro"		    = "Top Light Sensor";
"ALS PWM"		    = "Illumination Brightness";

/* nVidia GeForce 6x00 */
"gpu-diode" = "Graphics processor chip";
"gpu-case" = "Graphics processor case";
"gpu-fan" = "Graphics processor fan";

/* iMac G5 */
"Hard drive" = "Hard Drive";
"Hard Drive" = "Hard Drive Fan";
"System Fan" = "System Fan";
"CPU fan" = "CPU Fan";
"CPU Current" = "CPU 12 V Current";
"CPU Voltage" = "CPU 12 V Supply";
"CPU T-Diode" = "CPU Temperature";

/* iMac G5 Third Generation */
"GPU Ambient" = "Graphics Processor Ambient Air";
"GPU Temp" = "Graphics Processor Temperature";
"HD Temp" = "Hard Disk Temperature";
"Incoming Air Temp" = "Incoming Air Temperature";
"NB Ambient" = "Memory Controller Ambient Air";
"NB Temp" = "Memory Controller Temperature";
"ODD Temp" = "Optical Drive Temperature";
"HDD Fan" = "Hard Drive Fan";
"ODD Fan" = "Optical Drive Fan";

/* Neo2 PowerMac G5 */
"Slots Power" = "Slots Power";
"Rear Fan 0" = "Rear Fan 0";
"Rear fan 1" = "Rear fan 1";
"Front Fan" = "Front Fan";
"Slots Fan" = "Slots Fan";
"Drive Bay" = "Drive Bay Fan";

/* Xserve */
"Internal Ambient" = "Internal Ambient";
"Processor Module" = "Processor Module";
"12v supply" = "12 V supply";
"5v supply" = "5 V supply";
"3.3v supply" = "3.3 V supply";
"2.5v supply" = "2.5 V supply";
"Logic core" = "Logic core";
"Processor core" = "Processor core";

"CPU A POWER" = "CPU A Power";
"CPU B POWER" = "CPU B Power";
"CPU A VCORE" = "CPU A V core";
"CPU B VCORE" = "CPU B V core";
"CPU A 12V CURR" = "CPU A 12 V";
"CPU A CORE CURR" = "CPU A Core";	
"CPU B 12V CURR" = "CPU B 12 V";
"CPU B CORE CURR" = "CPU B Core";
"SYS CTRLR 1.5V SLEEP" = "System Controller 1.5 V Sleep";
"CPU A DIODE TEMP" = "CPU A Internal";
"CPU B DIODE TEMP" = "CPU B Internal";
"PCI SLOTS" = "PCI Slots";
"U3 AMBIENT" = "U3 Ambient";
"U3 INTERNAL" = "U3 Internal";

"Behind the DIMMS" = "Memory Bank";
"CPU A Ambient" = "CPU A Ambient";
"CPU A Diode" = "CPU A Internal";
"CPU B Diode" = "CPU B Internal";
"CPU B Ambient" = "CPU B Ambient";
"Between the Processors" = "Internal Ambient";
"SYS CTRLR AMBIENT" = "System Controller Ambient";
"SYS CTRLR INTERNAL" = "System Controller Internal";

"SYS CTRLR FAN" = "Fan System Controller";
"CPU A 1" = "Fan CPU A1";
"CPU A 2" = "Fan CPU A2";
"CPU A 3" = "Fan CPU A3";
"CPU B 1" = "Fan CPU B1";
"CPU B 2" = "Fan CPU B2";
"CPU B 3" = "Fan CPU B3";
"PCI FAN" = "Fan PCI Slot";
"U3 1.5V SLEEP" = "System Controller 1.5 V Sleep";
"12V TRICKLE A" = "12 V Trickle A";
"12V CPU A" = "12 V CPU A";
"2.5V SLEEP" = "2.5 V Sleep";
"3.3V SLEEP" = "3.3 V Sleep";
"5V SLEEP" = "5 V Sleep";
"1.2V SLEEP" = "1.2 V Sleep";
"1.5V SLEEP" = "1.5 V Sleep";
"EI_OVDD (1.2V)" = "System Bus I/O VDD";
"3.3V TRICKLE" = "3.3 V Trickle";
"1.5V" = "1.5 V";
"5V" = "5 V";
"1.8V" = "1.8 V";
"2.5V" = "2.5 V";
"3.3V" = "3.3 V";
"1.2V" = "1.2 V";

"CPU A INLET" = "CPU A Air Inlet Temperature";
"CPU B INLET" = "CPU B Air Inlet Temperature";

/* Apple Key Switch fake sensor support */
"KEY SWITCH" = "Enclosure Key Switch";

/* BRESINKx86Monitoring driver support */
"CPU Core 1" = "CPU Core 1";
"CPU Core 2" = "CPU Core 2";
"CPU Core 3" = "CPU Core 3";
"CPU Core 4" = "CPU Core 4";
"CPU Core 5" = "CPU Core 5";
"CPU Core 6" = "CPU Core 6";
"CPU Core 7" = "CPU Core 7";
"CPU Core 8" = "CPU Core 8";
"CPU Core 9" = "CPU Core 9";
"CPU Core 01" = "CPU Core 01";
"CPU Core 02" = "CPU Core 02";
"CPU Core 03" = "CPU Core 03";
"CPU Core 04" = "CPU Core 04";
"CPU Core 05" = "CPU Core 05";
"CPU Core 06" = "CPU Core 06";
"CPU Core 07" = "CPU Core 07";
"CPU Core 08" = "CPU Core 08";
"CPU Core 09" = "CPU Core 09";
"CPU Core 10" = "CPU Core 10";
"CPU Core 11" = "CPU Core 11";
"CPU Core 12" = "CPU Core 12";
"CPU Core 13" = "CPU Core 13";
"CPU Core 14" = "CPU Core 14";
"CPU Core 15" = "CPU Core 15";
"CPU Core 16" = "CPU Core 16";
"CPU Core Voltage" = "CPU Core Voltage";
"CPU Clock Frequency" = "CPU Clock Frequency";
"CPU Core 1 Hot" = "CPU Core 1 Hot";
"CPU Core 2 Hot" = "CPU Core 2 Hot";
"CPU Core 3 Hot" = "CPU Core 3 Hot";
"CPU Core 4 Hot" = "CPU Core 4 Hot";
"CPU Core 5 Hot" = "CPU Core 5 Hot";
"CPU Core 6 Hot" = "CPU Core 6 Hot";
"CPU Core 7 Hot" = "CPU Core 7 Hot";
"CPU Core 8 Hot" = "CPU Core 8 Hot";

/* MBS System Management Controller support */
"SMC AMBIENT AIR" = "Ambient Air";
"SMC AMBIENT AIR POSITION 2" = "Ambient Air Position 2";
"SMC AMBIENT AIR POSITION M" = "Ambient Air";
"SMC BATTERY" = "Battery";
"SMC BATTERY POSITION 2" = "Battery Position 2";
"SMC BATTERY POSITION 3" = "Battery Position 3";
"SMC BATTERY POSITION 4" = "Battery Position 4";
"SMC CPU A DIODE" = "CPU A Temperature Diode";
"SMC CPU B DIODE" = "CPU B Temperature Diode";
"SMC CPU C DIODE" = "CPU C Temperature Diode";
"SMC CPU D DIODE" = "CPU D Temperature Diode";
"SMC CPU A HEAT SINK" = "CPU A Heatsink";
"SMC CPU B HEAT SINK" = "CPU B Heatsink";
"SMC CPU C HEAT SINK" = "CPU C Heatsink";
"SMC CPU D HEAT SINK" = "CPU D Heatsink";
"SMC CPU A PROXIMITY" = "CPU A Proximity";
"SMC CPU B PROXIMITY" = "CPU B Proximity";
"SMC CPU C PROXIMITY" = "CPU C Proximity";
"SMC CPU D PROXIMITY" = "CPU D Proximity";
"SMC PCIE SLOT A" = "PCIe Slot A";
"SMC PCIE SLOT B" = "PCIe Slot B";
"SMC PCIE SLOT C" = "PCIe Slot C";
"SMC PCIE SLOT D" = "PCIe Slot D";
"SMC PCIE SLOT 1" = "PCIe Slot 1";
"SMC PCIE SLOT 2" = "PCIe Slot 2";
"SMC PCIE SLOT 3" = "PCIe Slot 3";
"SMC PCIE SLOT 4" = "PCIe Slot 4";
"SMC RAID CARD" = "RAID card";
"SMC GPU SUPPLY 1" = "Graphics Processor Supply 1";
"SMC GPU SUPPLY 2" = "Graphics Processor Supply 2";
"SMC GPU DIODE" = "Graphics Processor Temperature Diode";
"SMC GPU 1 HEAT SINK" = "Graphics Processor Heatsink 1";
"SMC GPU 2 HEAT SINK" = "Graphics Processor Heatsink 2";
"SMC GPU 1 CHIP" = "Graphics Processor Chip 1";
"SMC GPU 2 CHIP" = "Graphics Processor Chip 2";
"SMC DRIVE BAY 1" = "Hard Drive Bay 1";
"SMC DRIVE BAY 2" = "Hard Drive Bay 2";
"SMC DRIVE BAY 3" = "Hard Drive Bay 3";
"SMC DRIVE BAY 4" = "Hard Drive Bay 4";
"SMC MAIN HEAT SINK 1" = "Main Heatsink 1";
"SMC MAIN HEAT SINK 2" = "Main Heatsink 2";
"SMC MAIN HEAT SINK 3" = "Main Heatsink 3";
"SMC MAIN HEAT SINK F" = "Main Heatsink F";
"SMC LCD PROXIMITY" = "Display Screen Proximity";
"SMC MEMORY MODULE A1" = "Memory Module A1";
"SMC MEMORY MODULE A2" = "Memory Module A2";
"SMC MEMORY MODULE A3" = "Memory Module A3";
"SMC MEMORY MODULE A4" = "Memory Module A4";
"SMC MEMORY MODULE A5" = "Memory Module A5";
"SMC MEMORY MODULE A6" = "Memory Module A6";
"SMC MEMORY MODULE A7" = "Memory Module A7";
"SMC MEMORY MODULE A8" = "Memory Module A8";
"SMC MEMORY MODULE B1" = "Memory Module B1";
"SMC MEMORY MODULE B2" = "Memory Module B2";
"SMC MEMORY MODULE B3" = "Memory Module B3";
"SMC MEMORY MODULE B4" = "Memory Module B4";
"SMC MEMORY MODULE B5" = "Memory Module B5";
"SMC MEMORY MODULE B6" = "Memory Module B6";
"SMC MEMORY MODULE B7" = "Memory Module B7";
"SMC MEMORY MODULE B8" = "Memory Module B8";
"SMC MEMORY BANK A POS 0" = "Memory Bank A Point 0";
"SMC MEMORY BANK A POS 1" = "Memory Bank A Point 1";
"SMC MEMORY BANK A POS 2" = "Memory Bank A Point 2";
"SMC MEMORY BANK A POS 3" = "Memory Bank A Point 3";
"SMC MEMORY BANK A POS 4" = "Memory Bank A Point 4";
"SMC MEMORY BANK A POS 5" = "Memory Bank A Point 5";
"SMC MEMORY BANK A POS 6" = "Memory Bank A Point 6";
"SMC MEMORY BANK A POS 7" = "Memory Bank A Point 7";
"SMC MEMORY BANK A POS 8" = "Memory Bank A Point 8";
"SMC MEMORY BANK B POS 0" = "Memory Bank B Point 0";
"SMC MEMORY BANK B POS 1" = "Memory Bank B Point 1";
"SMC MEMORY BANK B POS 2" = "Memory Bank B Point 2";
"SMC MEMORY BANK B POS 3" = "Memory Bank B Point 3";
"SMC MEMORY BANK B POS 4" = "Memory Bank B Point 4";
"SMC MEMORY BANK B POS 5" = "Memory Bank B Point 5";
"SMC MEMORY BANK B POS 6" = "Memory Bank B Point 6";
"SMC MEMORY BANK B POS 7" = "Memory Bank B Point 7";
"SMC MEMORY BANK B POS 8" = "Memory Bank B Point 8";
"SMC MEMORY MODULE SLOT 1" = "Memory Module Slot 1";
"SMC MEMORY MODULE SLOT 2" = "Memory Module Slot 2";
"SMC MEMORY MODULE SLOT 3" = "Memory Module Slot 3";
"SMC MEMORY MODULE SLOT 4" = "Memory Module Slot 4";
"SMC MEMORY MODULE SLOT 5" = "Memory Module Slot 5";
"SMC MEMORY MODULE SLOT 6" = "Memory Module Slot 6";
"SMC MEMORY MODULE SLOT 7" = "Memory Module Slot 7";
"SMC MEMORY MODULE SLOT 8" = "Memory Module Slot 8";
"SMC MAIN LOGIC BOARD" = "Main Logic Board";
"SMC BATTERY CHARGER PROXIMITY" = "Battery Charger Proximity";
"SMC MEMORY OUTGOING AIR" = "Memory Area Outgoing Air";
"SMC VOLTAGE REGULATOR AREA" = "Voltage Regulator Area";
"SMC NORTHBRIDGE CORE" = "Northbridge Core";
"SMB NORTHBRIDGE CHIP DIE" = "Northbridge Chip";
"SMC NORTHBRIDGE HEAT SINK" = "Northbridge Heat Sink";
"SMC NORTHBRIDGE POS 1" = "Northbridge Position 1";
"SMC NORTHBRIDGE POS 2" = "Northbridge Position 2";
"SMC OPTICAL DRIVE" = "Optical Drive";
"SMC EXPANSION SLOTS" = "Expansion Slots";
"SMC POWER SUPPLY/BATTERY" = "Battery Power Supply";
"SMC POWER SUPPLY SENSOR 1" = "Power Supply Location 1";
"SMC POWER SUPPLY SENSOR 2" = "Power Supply Location 2";
"SMC POWER SUPPLY POSITION 1" = "Power Supply Position 1";
"SMC POWER SUPPLY POSITION 2" = "Power Supply Position 2";
"SMC POWER SUPPLY POSITION 3" = "Power Supply Position 3";
"SMC POWER SUPPLY POSITION 4" = "Power Supply Position 4";
"SMC POWER SUPPLY POSITION 5" = "Power Supply Position 5";
"SMC SECONDARY HEATSINK" = "Secondary Heatsink";
"SMC PRIMARY HEATSINK" = "Primary Heatsink";
"SMC PCI SLOT 1 POS 1" = "PCI Slot 1 Position 1";
"SMC PCI SLOT 1 POS 2" = "PCI Slot 1 Position 2";
"SMC PCI SLOT 2 POS 1" = "PCI Slot 2 Position 1";
"SMC PCI SLOT 2 POS 2" = "PCI Slot 2 Position 2";
"SMC PCI SLOT 3 POS 1" = "PCI Slot 3 Position 1";
"SMC PCI SLOT 3 POS 2" = "PCI Slot 3 Position 2";
"SMC PCI SLOT 4 POS 1" = "PCI Slot 4 Position 1";
"SMC PCI SLOT 4 POS 2" = "PCI Slot 4 Position 2";
"SMC LEFT PALM REST" = "Left Palm Rest";
"SMC RIGHT PALM REST" = "Right Palm Rest";
"SMC AIR VENT EXIT" = "Air Vent Exit";
"SMC WLAN CARD" = "Wireless Module";

"SMC FAN CPU_MEM" = "Fan CPU/Memory";
"SMC FAN IN0" = "CPU Fan 1 Inlet";
"SMC FAN IN1" = "CPU Fan 2 Inlet";
"SMC FAN IN2" = "CPU Fan 3 Inlet";
"SMC FAN IN3" = "CPU Fan 4 Inlet";
"SMC FAN IN4" = "FB-DIMM Fan 1 Inlet";
"SMC FAN IN5" = "FB-DIMM Fan 2 Inlet";
"SMC FAN IN6" = "FB-DIMM Fan 3 Inlet";
"SMC FAN OUT0" = "CPU Fan 1 Outlet";
"SMC FAN OUT1" = "CPU Fan 2 Outlet";
"SMC FAN OUT2" = "CPU Fan 3 Outlet";
"SMC FAN OUT3" = "CPU Fan 4 Outlet";
"SMC FAN OUT4" = "FB-DIMM Fan 1 Outlet";
"SMC FAN OUT5" = "FB-DIMM Fan 2 Outlet";
"SMC FAN OUT6" = "FB-DIMM Fan 3 Outlet";
"SMC FAN IO" = "Fan Expansion Slots";
"SMC FAN EXHAUST" = "Exhaust Fan";
"SMC FAN PS" = "Power Supply Fan";
"SMC FAN Exhaust" = "Exhaust Fan";
"SMC FAN Master" = "Master Fan";
"SMC FAN Left side" = "Left Fan";
"SMC FAN Right side" = "Right Fan";
"SMC FAN ODD" = "Fan Optical Disk Drive";
"SMC FAN HDD" = "Fan Hard Drive";
"SMC FAN CPU" = "CPU Fan";
"SMC FAN PS0IN" = "Fan Power Supply 1 In";
"SMC FAN PS1IN" = "Fan Power Supply 2 In";
"SMC FAN PS0OUT" = "Fan Power Supply 1 Out";
"SMC FAN PS1OUT" = "Fan Power Supply 2 Out";
"SMC FAN BOOSTA" = "Booster Fan CPU A";
"SMC FAN BOOSTB" = "Booster Fan CPU B";
"SMC FAN INTAKE" = "Intake Fan";
"SMC FAN PCI" = "Fan Expansion Slots";

"SMC AMBIENT LIGHT 1" = "Ambient Light 1";
"SMC AMBIENT LIGHT 2" = "Ambient Light 2";

"SMC CPU A" = "CPU A";
"SMC CPU B" = "CPU B";
"SMC CPU C" = "CPU C";
"SMC CPU D" = "CPU D";
"SMC CPU SUPPLY 1" = "CPU Supply 1";
"SMC CPU SUPPLY 2" = "CPU Supply 2";
"SMC CPU SUPPLY 3" = "CPU Supply 3";
"SMC CPU VOLTAGE SENSE" = "CPU Voltage Sense";
"SMC CPU HIGH SIDE" = "CPU High Side";
"SMC DC INPUT" = "DC Input";
"SMC 12V S5 LINE" = "12 V Line for Power Control";
"SMC DC V-SENSE" = "DC Voltage Sense";
"SMC AC/DC" = "Direct Current Power Supply";
"SMC PCIE SLOTS 12V RAIL" = "PCIe Slots 12V Rail";
"SMC PCI SLOT 1 12V LINE" = "PCIe Slot 1 12V Line";
"SMC PCI SLOT 2 12V LINE" = "PCIe Slot 2 12V Line";
"SMC PCI SLOT 3 12V LINE" = "PCIe Slot 3 12V Line";
"SMC PCI SLOT 4 12V LINE" = "PCIe Slot 4 12V Line";
"SMC PCI SLOT 1 12V BOOST LINE" = "PCIe Slot 1 12V Boost Line";
"SMC PCI SLOT 2 12V BOOST LINE" = "PCIe Slot 2 12V Boost Line";
"SMC GPU 1 V-SENSE" = "Graphics Processor 1 Voltage Sense";
"SMC GPU 2 V-SENSE" = "Graphics Processor 2 Voltage Sense";
"SMC MXM GRAPHICS MODULE" = "MXM Graphics Module";
"SMC OPTICAL DISK DRIVE" = "Optical Disk Drive";
"SMC OPTICAL DISK DRIVE 12V LINE" = "Optical Disk Drive 12V Line";
"SMC HARD DRIVE 1 12V LINE" = "Hard Drive 1 12V Line";
"SMC HARD DRIVE 2 12V LINE" = "Hard Drive 2 12V Line";
"SMC HARD DRIVE 3 12V LINE" = "Hard Drive 3 12V Line";
"SMC HARD DRIVE 4 12V LINE" = "Hard Drive 4 12V Line";
"SMC MEMORY VRM SUPPLY 0" = "Memory VRM Supply 0";
"SMC MEMORY VRM SUPPLY 1" = "Memory VRM Supply 1";
"SMC MEMORY VRM SUPPLY 2" = "Memory VRM Supply 2";
"SMC MEMORY VRM SUPPLY A" = "Memory VRM Supply A";
"SMC MEMORY VRM SUPPLY B" = "Memory VRM Supply B";
"SMC NORTHBRIDGE VCORE" = "Northbridge Core Voltage";
"SMC PSU 1 LINE 1" = "Power Supply 1 Line 1";
"SMC PSU 1 LINE 2" = "Power Supply 1 Line 2";
"SMC PSU 2 LINE 1" = "Power Supply 2 Line 1";
"SMC PSU 2 LINE 2" = "Power Supply 2 Line 2";
"SMC PBUS V-SENSE" = "Power Bus Voltage Sense";
"SMC NORTHBRIDGE" = "Northbridge";
"SMC NORTHBRIDGE 2" = "Northbridge 2";
"SMC EXPANSION SLOT 1" = "Expansion Slot 1";
"SMC EXPANSION SLOT 2" = "Expansion Slot 2";
"SMC EXPANSION SLOT 3" = "Expansion Slot 3";
"SMC EXPANSION SLOT 4" = "Expansion Slot 4";
"SMC CPU/VRM SUPPLY 0" = "CPU Voltage Regulator Supply 0";
"SMC CPU/VRM SUPPLY 1" = "CPU Voltage Regulator Supply 1";
"SMC CPU/VRM SUPPLY 2" = "CPU Voltage Regulator Supply 2";
"SMC CPU/VRM SUPPLY 3" = "CPU Voltage Regulator Supply 3";
"SMC CPU/VRM SUPPLY 4" = "CPU Voltage Regulator Supply 4";
"SMC CPU/VRM SUPPLY 5" = "CPU Voltage Regulator Supply 5";
"SMC CPU/VRM SUPPLY 6" = "CPU Voltage Regulator Supply 6";
"SMC CPU/VRM SUPPLY 7" = "CPU Voltage Regulator Supply 7";
"SMC CPU/VRM SUPPLY 8" = "CPU Voltage Regulator Supply 8";
"SMC CPU/VRM SUPPLY 9" = "CPU Voltage Regulator Supply 9";
"SMC CPU/VRM SUPPLY A" = "CPU Voltage Regulator Supply A";
"SMC CPU/VRM SUPPLY B" = "CPU Voltage Regulator Supply B";
"SMC CPU/VRM SUPPLY C" = "CPU Voltage Regulator Supply C";
"SMC CPU/VRM SUPPLY D" = "CPU Voltage Regulator Supply D";
"SMC CPU/VRM SUPPLY E" = "CPU Voltage Regulator Supply E";
"SMC CPU/VRM SUPPLY F" = "CPU Voltage Regulator Supply F";
"SMC MAINBOARD MONITOR 0" = "Mainboard Monitoring 0";
"SMC MAINBOARD MONITOR 1" = "Mainboard Monitoring 1";
"SMC MAINBOARD MONITOR 2" = "Mainboard Monitoring 2";
"SMC MAINBOARD MONITOR 3" = "Mainboard Monitoring 3";
"SMC MAINBOARD MONITOR 4" = "Mainboard Monitoring 4";
"SMC MAINBOARD MONITOR 5" = "Mainboard Monitoring 5";
"SMC MAINBOARD MONITOR 6" = "Mainboard Monitoring 6";
"SMC MAINBOARD MONITOR 7" = "Mainboard Monitoring 7";
"SMC MAINBOARD MONITOR 8" = "Mainboard Monitoring 8";
"SMC MAINBOARD MONITOR 9" = "Mainboard Monitoring 9";
"SMC BATTERY I-SENSE" = "Battery Current Sense";
"SMC CPU A FRONT SIDE BUS TERMINATION" = "CPU A Front Side Bus Termination";
"SMC CPU B FRONT SIDE BUS TERMINATION" = "CPU B Front Side Bus Termination";
"SMC FIREWIRE PORTS" = "FireWire Ports";
"SMC PLATFORM CONTROLLER HUB" = "Platform Controller Hub";
"SMC SSD BAY" = "Solid State Drive";
"SMC MEMORY SLOTS" = "Memory Slots";
"SMC THUNDERBOLT PORT 1" = "Thunderbolt Port 1";
"SMC THUNDERBOLT PORT 2" = "Thunderbolt Port 2";
"SMC THUNDERBOLT PORT 3" = "Thunderbolt Port 3";
"SMC THUNDERBOLT PORT 4" = "Thunderbolt Port 4";
